[
{"_id":{"$oid":"6781c0b053b24b8c782beae0"},"title":"Study suggests restricting coffee consumption to a specific time window may reduce the risk of early death.","description":"A recent study builds on previous research showing that moderate coffee consumption may be linked to lower risks of type 2 diabetes, cardiovascular diseases, and premature death. However, the impact of factors such as genetics, the amount of coffee consumed, or added sweeteners has been inconsistent or controversial, according to the study's authors.\r\n\r\nThe study analyzed dietary and health data from 40,725 adults aged 18 and older, collected during the National Health and Nutrition Examination Survey from 1999 to 2018. Participants reported their daily food intake across 10 cycles, with a subgroup of 1,463 adults also providing detailed weeklong dietary records. Both caffeinated and decaffeinated coffee were included, and consumption was categorized into three time periods: morning (4 a.m. to 11:59 a.m.), afternoon (12 p.m. to 4:59 p.m.), and evening (5 p.m. to 3:59 a.m.).\r\n\r\nTwo patterns of coffee consumption timing were identified: morning-only and all-day drinking. After nearly 10 years of follow-up, the study recorded 4,295 deaths from all causes, 1,268 from cardiovascular disease, and 934 from cancer.\r\n\r\nThe study found that drinking coffee only in the morning was associated with a 16% lower risk of premature death from any cause and a 31% lower risk of dying from cardiovascular disease, compared to those who didn’t drink coffee. In contrast, those who consumed coffee throughout the day did not experience a reduction in risk. These findings remained significant even after adjusting for factors such as sleep duration, age, race, ethnicity, sex, income, education, physical activity, and health conditions like diabetes, hypertension, and high cholesterol.\r\n\r\nInterestingly, the quantity of coffee, whether caffeinated or decaffeinated, didn’t influence the results for morning coffee drinkers. Whether they consumed less than one cup or more than three cups per day, drinking coffee only in the morning was still associated with a lower risk of mortality.","category":"Lifestyle","author":"Karen Rogers","image":"/1736556720802_gettyimages-1326279152.webp","authorImg":"/author_img.png","date":{"$date":"2025-01-10T23:55:51.865Z"},"__v":0},
{"_id":{"$oid":"6781c48353b24b8c782beaf5"},"title":"Supreme Court seems likely to support TikTok ban","description":"On Friday, the Supreme Court appeared inclined to uphold a law that could lead to the sale or ban of the popular short-video app TikTok in the U.S. by January 19, with justices concentrating on the national security concerns related to China that triggered the crackdown.","category":"Technology","author":"Stephen King","image":"/1736557699516_gettyimages-14702682691-ce3194de5c4b1aaaba962bc2b81b3e5103a06da8.jpg","authorImg":"/author_img.png","date":{"$date":"2025-01-10T23:55:51.865Z"},"__v":0},
{"_id":{"$oid":"6781c5b353b24b8c782beaf9"},"title":"Coco Gauff's time to shine","description":"Despite all she has accomplished so far and the high expectations that come with being one of tennis' rising stars, it's easy to forget that Coco Gauff is still only 20 years old.\r\n\r\nHeading into the Australian Open, which runs from January 12 to 26, the American is in exceptional form.\r\n\r\nAfter winning her first WTA Finals title in November, Gauff began 2025 with an undefeated week in both singles and doubles, helping lead the USA to a second United Cup title in Australia.\r\n\r\nNotably, she appears to have broken her losing streak against Iga Świątek. Gauff had won only one of her first 12 encounters with the Polish player, but now has two consecutive victories over Świątek at the WTA Finals and United Cup.\r\n\r\nIn September, Gauff made a coaching change, hiring renowned grip specialist Matt Daly after parting ways with Brad Gilbert. With Daly's guidance, Gauff has made notable improvements to her forehand and serve, two areas that had contributed to a challenging stretch of results last season.","category":"Sports","author":"Karen Hill","image":"/1736558003321_coco-gauff.webp","authorImg":"/author_img.png","date":{"$date":"2025-01-10T23:55:51.865Z"},"__v":0}
]